{
  "raynnacs": {
    "bio": "Creator of @Esportal_Bot\n\nCommands\n\n!esportal\n!faceit\n!steam\n!premier\n!rank\n!stats\n!faceitstats\n!today\n!yesterday\n!week\n!lastgame\n!match\n!gather\n!games\n!news\n\nEsportal_Bot Discord\n\nIf you would like to support me, just giving a follow is greatly appreciated, so donations are not expected from you, but you can donate anything that you feel would improve the stream in any way!\n\niitzhugge - Logitech C922 Pro Webcam\niitzhugge - Nvidia GTX 1080\nsemlanrite - Ak-47 Redline\n\nTrade Offer Link\n\nTo register this bot to your channel, you can type:\n\n!addme\n\nAfter you registered the bot you have to mod it with:\n\n/mod esportal_bot\n\nNOTE: The bot does only connect to streamers who are online, it will not connect if you're offline, but you can register it while being offline.\n\nIf you ever wanna remove the bot from your channel, you can type:\n\n!removeme",
    "timestamp": 1736825647763
  },
  "parally": {
    "bio": "I'm Kayla aka Parally! I'm a 26 year old full-time streamer and full-time dumbass, and having a blast with both. :) I've been streaming since January of 2021 when I started with variety, but have been mainly RuneScape since April of 2021 with a bit of variety here and there!\n\nI go live around 6:30/7pm CT!\n\nNo streams Saturdays or Wednesdays unless otherwise specified. :)\n\nDonations are not at all required, but if you would like to support the stream further, feel free to click the banner above or here! Thank you so much for the support!\n\nDisclaimer: Donations are non-refundable. By donating, you agree that these are your own funds and will not charge back/refund the donation. There are no goods or services tied to donating and the action is strictly voluntary if you do choose to donate!",
    "timestamp": 1736825675856
  },
  "drincompetentgamer": {
    "bio": "Check out more videos from this game and many, MANY others YouTube!\n\nSupport the channel by becoming a Patron!\n\nContinue the conversation, get stream updates, and more by joining our Discord!\n\nIf you are feeling generous, use this link to give me a tip and help support the channel! Thank you!\n\nWant some Dr. Incompetent Merch for your office white elephant gift exchange? Are you looking to confuse strangers with your shirts and hats? Stop on in!",
    "timestamp": 1736825874889
  }
}