{
  "raynnacs": {
    "bio": "Creator of @Esportal_Bot\n\nCommands\n\n!esportal\n!faceit\n!steam\n!premier\n!rank\n!stats\n!faceitstats\n!today\n!yesterday\n!week\n!lastgame\n!match\n!gather\n!games\n!news\n\nEsportal_Bot Discord\n\nIf you would like to support me, just giving a follow is greatly appreciated, so donations are not expected from you, but you can donate anything that you feel would improve the stream in any way!\n\niitzhugge - Logitech C922 Pro Webcam\niitzhugge - Nvidia GTX 1080\nsemlanrite - Ak-47 Redline\n\nTrade Offer Link\n\nTo register this bot to your channel, you can type:\n\n!addme\n\nAfter you registered the bot you have to mod it with:\n\n/mod esportal_bot\n\nNOTE: The bot does only connect to streamers who are online, it will not connect if you're offline, but you can register it while being offline.\n\nIf you ever wanna remove the bot from your channel, you can type:\n\n!removeme",
    "timestamp": 1736825647763
  },
  "parally": {
    "bio": "I'm Kayla aka Parally! I'm a 26 year old full-time streamer and full-time dumbass, and having a blast with both. :) I've been streaming since January of 2021 when I started with variety, but have been mainly RuneScape since April of 2021 with a bit of variety here and there!\n\nI go live around 6:30/7pm CT!\n\nNo streams Saturdays or Wednesdays unless otherwise specified. :)\n\nDonations are not at all required, but if you would like to support the stream further, feel free to click the banner above or here! Thank you so much for the support!\n\nDisclaimer: Donations are non-refundable. By donating, you agree that these are your own funds and will not charge back/refund the donation. There are no goods or services tied to donating and the action is strictly voluntary if you do choose to donate!",
    "timestamp": 1736825675856
  },
  "drincompetentgamer": {
    "bio": "Check out more videos from this game and many, MANY others YouTube!\n\nSupport the channel by becoming a Patron!\n\nContinue the conversation, get stream updates, and more by joining our Discord!\n\nIf you are feeling generous, use this link to give me a tip and help support the channel! Thank you!\n\nWant some Dr. Incompetent Merch for your office white elephant gift exchange? Are you looking to confuse strangers with your shirts and hats? Stop on in!",
    "timestamp": 1736825874889
  },
  "nooblet": {
    "bio": "hi. You're probably here for Mickey anyway.\n\nOr use this! HERE\n\nDon't feel like you need to give anything to me! This is just here for anyone who wants to support the stream further and I appreciate it :).\nDisclaimer: All donations are non-refundable and by clicking donate, you agree that this is your money, as well as not to refund it.\n\nTop Tips:\n\n1. discard_200m - $1569.69 wwwww\n2. Derparnieux - $1515 noobletHeart\n3. Kaane - $886\n4. Aziz - $850.37\n5. xXFallinFearsXx - $780\n6. mrbrendon999 - $770.61\n7. SilentWalrus1 - $712.05\n8. Stingeli - $573.87\n9. Skyriderdragoon - $465.06\n10. Melloorr - $423.92 Biffy Bud #2\n\nQ. How old are you and where are you from?\n\nA. I'm 27 and I have lived in Minnesota all my life. It's like Canada but in the US.\n\nQ. When did you start playing Runescape?\n\nA. I started playing in early 2006ish or 1995 idk.\n\nQ. What is your job and school situation?\n\nA. I'm dropped out after 2 years of Uni in Oct 2017 and I'm streaming and making videos full time :).\n\nQ. What other games do you play?\n\nA. I stream primarily Runescape. I do play CS:GO in my free time a lot, maybe go pro one day.\n\nYoutube\nTwitter\nDiscord\n\nMy Rig\n\nCase: Fractal Design Meshify C ATX Mid\nOS: Windows 10\n**CPU:**AMD Ryzen 5 5600x\nRAM: Corsair Vengeance RGB Pro 32GB\nGPU: Asus GTX 1080 Strix\nSSD: Western Digital Blue 2TB M.2\nHDD: Western Digital Black 6TB\nPSU: Corsair TXM Gold 650w 80+ Gold\n\nHardware\n\nWebcam: Logitech C920\nMicrophone: audio-technica AT2020\nAudio Interface: Focusrite Scarlett Solo\nMouse: garbage\nKeyboard: Corsair K55\nHeadphones: audio-technica M50x\nMonitor: ASUS 27\" 1440p 144Hz, BenQ 24\" RL2455HM\n\nI stream with OBS Studio\n\nClick the above image to go to Amazon.com using my Affiliated link or click HERE. Just search what you want to buy and any items purchased using this, will directly support me! Currently, only works for US customers. If you're interested but aren't able to use it, tell me and I'll try to add more countries.\nTry Amazon Prime FREE for 30 Days: HERE.\nTry Audible FREE for 30 Days: HERE.\n\nEvery trial made will greatly support me, so if you do thanks!\n\nAmazon and the Amazon logo are trademarks of Amazon.com, Inc. or its affiliates.",
    "timestamp": 1736847244386
  },
  "tiimwork": {
    "bio": "Im a blue eyed ginger which is 1% of the popularity of the world flex i've always loved video games and still does it, and still remember the old golden eye on Nintendo 64 even today. I stream everyday usually, if i dont do it, something is wrong :P i love the streaming and is hoping to grow an awesome community around my stream. I like the write poetry aswell which i do alot, so i hope you enjoy your stay. And bless your soul\n\nAge: 33\n\nName: Tim\n\nLive: Sweden\n\nI PLAY:\n\nCS2,\nDota 2,\nHearthstone,\nWoW SoD\n\nIm playing other games aswell but this is what i play the most!\n\n1. No flaming\n\n2. Allowed languages English/Swedish\n\n3. No unnecessary spam\n\n4. Don't ask for mod, ill ask you if i need one\n\n5. Don't beg for free skins or giveaways, ill have a giveaway when i feel for it.\n\n5. Some links are allowed, like youtube/steam/gyazo/imgur but ask for permission if it's something else.\n\nOther then that, feel free to ask questions and enjoy the stream!\n\nClick on the picture above to donate!\n\nAll kinds of support i get is very appriciated. It cannot be refunded tho!\n\nIf you wanna show your support in other ways then paypal, speak out and u could scan my qr code to send some on swish aswell\n\nmaddepanda 282$\n\nOggah 35.00$\n\nkickzone_ 30.00$\n\nRagnWald 25.00$\n\nIcewac 17.69$\n\nValon 12.00$\n\nWWarriba 11.86$\n\nMadnisse 10.00$\n\nCLUTCHNORRIS 10.00$\n\ncharalandin 10.00$\n\nNBSwagga 9$\n\nSCL_Gaming 7.03$\n\nMajkmannen 5$\n\nCrashrob 1$\n\nTop single donation maddepanda 40$\n\nI usually stream from 3PM-10PM so enjoy spending time in here\n\nIf im not streaming i usually work with new vids for my social medias or are extremly tired.\n\nClick on the picture above to donate!\n\nWanna get rid of some skins? feel free :) and thank you if you do <3\n\npoolso - skins worth around 1000-2000$\nPhille123456 - M4a1-s Cyrex, AWP Asiimov, MAC-10 Neon rider\nBreakaleg - Dota 2 skins worth 60€~\nMadnisse - A Logitech c920e webcam\nLindrozzo Xtrfy M4\nImfakeerino - Falchion knife Boreal forest FT\nRagnwald - Food from FAVO\n\n**Monitors: AOC 2560x1440p -- AOC 27\" 240 hz\n\nKeyboard: Corsair K55 RGB PRO Gaming\n\nMouse: Xtrfy M4\n\nHeadset: HyperX Cloud Stinger 2 Wireless\n\nGraphics card: MSI GeForce RTX 4070 VENTUS 2X OC\n\nHard drive: Kingston FURY Renegade PCIe M.2 NVME SSD 2TB\n\nProcessor: Intel Core i7 13700F Tray\n\nRAM: Kingston FURY Beast RGB DDR5 5600MHz 32GB\n\nMotherboard: ASUS TUF GAMING B760-PLUS WIFI\n\nWebcam: Logitech C920e\n\nCSGO-wrraj-i6qcq-j3ipF-FPnFf-Dd4NF",
    "timestamp": 1736847248069
  },
  "masterpipe83": {
    "bio": "Completely voluntary! On the other hand, it is really appreciated if you want to support my stream❤️. Trying to give back as much as possible in the form of giveaways. Thanks!\n\nBriefly about me!\n41 year old father of 2+2 boys. 2 of my own and 2 bonus ==). I met my partner through cs (condition zero) about 14 years ago and we moved in together about 8 years ago.\nWe are a real gaming family where all the boys plays more or less. My youngest boy is the one who invests whole heartedly in his gaming and possesses great talent in csgo in particular. MaiL09, commit it to memory!\nStart streaming and think and hope I can entertain someone out there. If you have more questions, just ask them in the chat and I will answer.\nOur family can also be followed on YouTube under the name Gamingfamiljen<3\nSee you soon!\n\nThis guy is helping me alot. Hook him up ;)",
    "timestamp": 1736847251948
  },
  "moistbean": {
    "bio": "Hey, my name's Chris and i'd like to share my crazy experiences with you all.\n\nWe play a variety of games and my 8 years of stream has taught me one thing. I'm terrible at them all..\n\nThanks for taking the time to read and watch my stream, I appreciate every view.\n\nPlease consider supporting me and the stream! *All donations are non refundable. Thank you\n\n~COOLERMASTER HAF 912 PLUS MID TOWER GAMING CASE\n\n~ Nvidia RTX 2070 Super\n\n~Intel i5- 10600K @ 4.6GHz\n\n~ MSI Z490 Tomahawk Motherboard\n\n~16Gb Ballistix DDR4 RAM\n\n~Plextor PX-G128M6e 128GB M.2 SSD\n\n~Windows 10 Home Premium 64-Bit\n\n~CORSAIR 750W CX750 SERIES™ POWER SUPPLY\n\n~Corsair H60 Hydro Series High Performance CPU Cooler\n\n~1863GB TOSHIBA DT01ACA200 ATA Device (SATA)\n\n~931GB TOSHIBA DT01ACA100 ATA Device (SATA)\n\n~S220HQL (1920x1080@60Hz)\n\n~227E4LH (1920x1080@60Hz)\n\nA massive thank you to everyone on this list, no matter how big the donation, every little helps make the stream a greater place to be!\n\nTrue_Sayian_Gaming £5250.00.\n\nStarbell05 £963.18\n\nMitchTimmy £174.87\n\nSleet94 £171.50\n\nApsRage £141.00\n\nRsTiga £100.91",
    "timestamp": 1736847258541
  },
  "kimsomfan": {
    "bio": "Mitt namn är Kim, 27 år gammal som precis börjat streama. Kommer spela CS, League of legends.\n\nInget speciellt schema för tillfället, streamar när jag har tid och lust!\n\nDonations are very appreciated and only donate if you can afford to do so, they are NON-REFUNDABLE!\n\nInget toxic i chatten\n\nVar trevliga\n\nBara för att jag är toxic behöver inte ni vara det\n\nBrutna regler leder till ban",
    "timestamp": 1736847261141
  },
  "whitegrimreaper_": {
    "bio": "Name: White\n\nAge: 29\n\nLocation: Seattle (Bellevue), WA\n\nMy Specs:\n\nNEW PC\n\nCase: Meshify 2\n\nCPU: 5800X3D\n\nCPU Cooler: NHD15\n\nMOBO: Gigabyte X570 AORUS Pro Wifi\n\nRAM: Crucial Ballistix RGB 2x16GB\n\nGPU: MSI 4090 Suprim Liquid X\n\nPSU: EVGA Supernova G3 850\n\nDrives: Sabrent Rocket Q4 2TB, Seagate IronWolf NAS 10TB, Samsung 860 Pro 2TB\n\nKeyboard: KBD8X MKII with Boba U4T and SA Knight King\n\nMouse: Special Edition Glorious Model 0, Razer Naga Trinity (for RS3)\n\nMic: Rode Procaster through a FetHead into a Focusrite Scarlett 2i2\n\nHeadphones: Sennheiser HD6XX\n\nMonitors: LG 27GL850 * 2, LG 34WN80C * 2\n\nDuring D&D streams:\n\nMap and Map Assets by 2-Minute Tabletop\nSome music from TabletopRPGMusic https://www.patreon.com/tabletoprpgmusic\n\nSome maps from https://www.patreon.com/czepeku/posts",
    "timestamp": 1736847264224
  },
  "kram_yelooc": {
    "bio": "Music by Approaching Nirvana\nhttp://youtube.com/user/approachingnirvana\nCheck them out on iTunes: http://bit.ly/1aw7TkY",
    "timestamp": 1736847266891
  },
  "libbzer": {
    "bio": "ENGLISH\nMy name is Liban and my nickname is ''Libbe/Libbz'' On my spare time, I spend a lot of time on gaming and football.\n\nSWEDISH:\nJag heter Liban men går under namnet Libbe/Libbz här på alla medier, är en grabb från Stockholm som brinner starkt för gaming och fotboll.\n\n!age\n!rank\n!social\n!subs\n!youtube\n!uptime\n!settings\n!discord\n\nWarlock: 550$\nOliver: 100 $\nAcorex: 80 $\nPernilleThomassen: 71 $\nMoon: 60$\n1smarre: 56 $\nSilee: 25 $\nAref: 20 $\nJapanish: 25 $\nArgoliz: 12 $\nJackson: 10 $\n\nJag uppskattar verkligen VARJE enskild donation!\nDonera är helt frivilligt.\nFör att donera via PayPal eller kontokort, tryck på \"donate\" knappen så kommer du vidare\n\nAnnars kan ni swisha mig =)\n\nSwish: 070 75-47 316\n---> INGA DONATIONER ÅTERBETALAS!! <---\n\nENGLISH:\nI appreciate everyone who supports my stream whether it be through a follow, subscription, or donation. Donations will never be asked for, however all donators will be thanked publicly on stream. Thank you in advance for your support!\n\n❤️ Internet Friendly - Ett initiativ för att främja en hållbar och trivsam kultur på internet. Är du nyfiken eller vill bli ambassadör? Läs mer på InternetFriendly.se ❤️\n\nWant to play with me, or just play on a amazing platform with good players and leaders? Sign up Esportal via steam account for free and enjoy. You can also play verify gathers and star gathers and it's 100% drop\n\nAwesome website for players =D\n\n● Spam is strictly prohibited and may lead to ban\n\n● Try to not use caps all the time when typing in chat (it's okey sometimes\n\n● Do not send links without permission by moderators (this can get you banned)\n\n● The timeout is (600 seconds)\n\n● Do not hate on each other in the chat, it can lead to you both get a timeout or a ban.\n\nSWEDISH:\n● Spam är totalt förbjudet och kan leda till ban\n\n● Försök att inte använda CAPS-LOCK så ofta i chatten (självklart är det okej ibland :D)\n\n● Länkar är helt förbjudet att sändas i chatten\n\n● Timeout är (600 sekunder)\n\nFeel free to follow me on Instagram<3\n\nSWEDISH:\nNi kan gärna följa mig på Instagram<3\n\nlibanabdulkadir1997@gmail.com",
    "timestamp": 1736847269360
  },
  "punishd1": {
    "bio": "Välkommen till Tradeit på Esplay! Lägg till Tradeit-medaljen bredvid ditt nick för större chans på drops. 🎁 Gör din första trade över $100 och få $5 extra i skins – besök tradeit.gg\n\n• CPU: AMD Ryzen 7 5800X3D\n• GPU: GeForce RTX 3060 Ti GAMING Z\n• RAM: 16GB Corsair Vengeance DDR4\n• CASE: Corsair iCUE 4000X RGB Svart\n\n• Donationer via PayPal kan göras här, dom uppskattas otroligt mycket.\nKom ihåg att donationer inte är återbetalningsbara.",
    "timestamp": 1736847272020
  },
  "gurkinator_": {
    "bio": "🎁 Giveaway varje tisdag kl. 16:00 - 19:00! 🎁\n\nVi lottar ut 2x Tradeit.GG lådor! 🔥\nGå med i mitt Space och Tradeit.gg's Space för att delta.\nSkriv !esplay & !space i chatten för att komma direkt till spaces! 🚀✨\n\n🔔 Varje vecka droppar vi skins från Tradeit, och ibland även knivar! 🎉 Joina mig på www.esplay.com/tradeit och var med i mina matcher så ses vi där! 💥\n\nGenom att använda Tradeit's medalj på esplay.com kommer dina chanser att få drops förbättras avsevärt.\n\nCPU: Intel I5 13600K\nGPU: GeForce GTX 4070ti Super\nRAM: 32gb\n\nKeyboard: Corsair K95 Platinum\nHeadset: Steelseries Arctis 7+\nMouse: Razer Deathadder v3 pro (dpi 1000)\nIn-game sensitivity 0.73\nResolution: 1280x960 (Blackbars)\nGraphic settings: High\n\nDonationer är inget som är obligatoriskt eller förväntas, men mottages med stor tacksamhet.\n\nDonationer är inget som är obligatoriskt eller förväntas, men mottages med stor tacksamhet.",
    "timestamp": 1736847274540
  },
  "eskeminha": {
    "bio": "Support the streamer !\n\nMobo: Gigabyte B650M Gaming X AX\nMemory: 32GB Corsair Dominator DDR5\nCPU: AMD Ryzen 7 7800X3D 8-Core Processor 4.20GHz\nCooling: Custom Watercooler\nMain Storage: M.2 2Tb Corsair MP600 PRO XT\nExtra SSD: 4x 240GB HyperX Savage\nVGA: MSI Geforce RTX 4070Ti Ventus 3x\nMonitor: LG 65\" 4k TV\nPower: EVGA Supernova 1600 G2\nKeyb: Logitech MX Keys S (Full Size)\nKeypad: Razer Orbweaver\nMouse: Logitech MX Master 3S\nHeadset: HyperX Cloud II\nMic: Razer Seiren\nCase: Cooler Master Cosmos II\n\nYouTube\n\nSubscribe !",
    "timestamp": 1736847277112
  },
  "chevalricrs": {
    "bio": "PC\n\nCPU: AMD Ryzen 7 3700X 8-Core Processor 3.60 GHz\nGPU: NVidia GeForce GTX 1660 Super\nRam: 32GB\n\nExtra\n\nMouse: SteelSeries Rival 310 eSports Wireless\nKeyboard: Razer Ornata Chroma\nMonitors: Acer Nitro XV273X 28' + Samsung TV 32'\nMicrophone: Devine M-Mic USB BK Condensator Microphone\nWebcam: FHD Camera\n\nHi my name is Chevalric, but you can call me Chev or Daan :D\n\nI mainly stream RuneScape 3, but sometimes dabble in other games like Pokémon and other RPG's.\n\nMy main goal is to have a good time over here on twitch and meet some amazing new people through my streams. Hope to see you in one soon :D\n\nHelp me improve my set-up so i can provide better streams for you guys!\n\nCurrent upgrade Goals:\n\nBetter Capture Device\nProfessional Lighting\n\nCome and join our little community over on Discord! This is the best place to share pictures of your shinies, find trades & battles and of course to talk to me and other members of our community when the stream isn't live ! :)\n\nMissed the stream and want to see my reactions or Commentary on certain topics? Go check out my YouTube Channel and when you are there, don't forget to click that subscribe button :)\n\nFollow me on Twitter to stay up-to-date with my activities! This is where i usually let you guys know what time I am going live at and if there are any changes to the regular schedule! I also share updates on the things I am up to in my life :)\n\n** All times are in GMT (European Central Time) and in the evenings (PM)\"\"\n\nI try to stream daily, when I can't stream i announce it in my Discord!. Most of my livestreams will start and end around:\n\n7:00PM - 10:00PM (GMT +1)\n\nMonday\n\nRunescape\n\nTuesday\n\nRunescape\n\nWednesday\n\nRunescape\n\nThursday\n\nRunescape\n\nFriday\n\nRunescape\n\nSaturday\n\nRunescape\n\nSunday\n\nNo stream / RuneScape\n\n** ANY CHANGES WILL BE ANOUNCED VIA TWITTER AND DISCORD**\n\nConvertions to your time zones:\nUK: -1 hour\nEast-Coast: -6 hours\nWest-Coast: -9 hours\n\nGo check out all the lovely people that helped me create the artwork and emotes for my Channel!\n\nACPL\nhttps://www.reddit.com/user/ACPL?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1\n\nFawxo - Emote Designer\nhttps://linktr.ee/fawxo\n\nGlosslipjm - Subbadge Designer\nhttps://linktr.ee/glosslipjm\n\nFollow me on Instagram to stay up-to-date with my music related activities!",
    "timestamp": 1736847280476
  },
  "duckonatruck": {
    "bio": "Donations helps the stream grow. I appreciate all the donations.\n\nBaronen 100$ <3\n\nnetworm/swallgren92 800kr\n\nlikesithotandbitter 61$ <3\n\nWarlock - 50$ <3\n\nBdog - 40 Euro <3\n\nTjNorris - $30.00 <3\n\ndisco - $25.00 <3\n\nBaronen1 - 300 SEK <3\n\nWonder - 15$ <3\n\nChristan - 10$ <3\n\nWelcome! My name is jesper also known as \"Duck\". I'm 26 years old and live in small town in sweden!\n\nI play a lot of other games but will probably stream CS most of the time!\n\nI try my best to be the best in cs but i suck! #nohate #nobait",
    "timestamp": 1736847284450
  },
  "cakez77": {
    "bio": "StreamElements ❤️\nKo-Fi 💙\n\nMon-Fri: 11am - 3pm GMT+2\n\nIf you want to send me stuff:\nPackstation 141\n48149 Muenster\nPostnumber: 1072188658\n\nI like programming all sorts of things but I really like programming and changing games. In almost every game I come across I would change a few things, I mean who wouldn't?\n\nMy favorite games are Gothic 1-3, Skyrim, POE and They are Billions, ...\n\nI like challenging myself by playing on the hardest difficulty. I also like adding rules to games to make them more interesting, for example 1 Life runs.\n\nI program every day to one day finish and sell my first commercial game called \"Cakez TD\" and I will be documenting this journey on Twitch and YouTube.\n\nCPU: AMD Ryzen 7, 3700X 8- Core @3.6GHZ (gifted by Zerray)\nGPU: GeForce RTX 4060 Ti (gifted by Trampel1000, Thank you BRO!)\nRAM: 32GB DDR4 (gifted by Zerray)\nMainboard: ROG STRIX B550-F Gaming (gifted by Zerray)\nMic: Shure sm7b\nInterface: Yamaha AG 03\nThank you guys for being so KIND! ❤",
    "timestamp": 1736847288042
  },
  "ibraofc": {
    "bio": "Namn: Sebastian\nÅlder: 33år ung\nStad: Göteborg\nEtnicitet: Libanon/Sverige",
    "timestamp": 1736847291779
  },
  "1linneaa": {
    "bio": "Skulle betyda otroligt mycket om ni ville joina mitt space på esplay. Jag kommer att lägga upp gathers där. Samt ha Ladders och lite annat i den. Uppdaterar där med kommande Giveaways. Klicka bara på bilden och sedan gå med. \"Välkommen hem\" 💚💚\n\n♡ My name is Linnéa\n♡ Im 31 Years old\n♡ Short amoste a dwarfie\n♡ Kind\n♡ Blond\n♡ II mostly play CS, but sometimes also League of Legends. Just started playing some World of Warcraft again\n\n♡ Much appreciated, helps the stream! Donations are non refundable ♡\n\n♡ Be nice to eachother\n♡ No politics\n♡ No sexism\n♡ No racism\n\n🎁 Giveaway Lördag kl. 13:00 - 16:00! 🎁\n\nVi lottar ut 2x Tradeit.GG lådor! 🔥\nGå med i mitt Space och Tradeit.gg's Space för att delta.\nSkriv !space & !tradeit i chatten för att komma direkt till spaces! 🚀✨\n\nGenom att använda Tradeit's medalj på esplay.com kommer dina chanser att få drops förbättras avsevärt. 💚",
    "timestamp": 1736847357735
  },
  "itsoik": {
    "bio": "Proud member of the Co-working & Coding Club\n\nMy first title on steam!\n\nWe have to dig deeper - A tabletop game developed by 2 persons in 7 weeks for a school project. (as a mod for Tabletop Simulator)\nco-creator: psyayavt\nWe Have To Dig Deeper\n\nSpecial thanks:\nBits:\n\n-> bobsticlez - 26,100\n-> Little_chicken - 15,400\n-> BearStealsKills - 10,305\n\nSub Streak:\n\n-> Psynergi00 - 44\n-> Matissetec - 22\n\nGift Sub :\n\n-> Nexxerd - 80\n-> Matissetec - 62\n-> Joviex - 52\n\nDonations:\n\n-> Big_Illu - 220$\n-> ESPENSIo - 75$\n-> mufsen - 60$\n\nGame Donations:\n\n-> Resident Evil - The Village Deluxe - Espensio\n-> BIOmutant - Espensio\n-> Stationeers - psynergi00\n-> SWTOR - gametime -psynergi00\n-> Astroneer - imbluedaba\n-> FireWatch - bearstealskills\n-> Flåklypa Grand Prix - Siljerussel\n\n(sorry if i miss anyone - feel free to notify me)\n(updated at the end of each month)\n\n🎞️ YouTube\n💬 Discord\n🖥️ itsOik.com\n\nMonitors 🖥️:\n\nSamsung G9 Neo 49\" 240Hz 1440p 32:9\nAsus VG27B 24\" 165hz 1440p\nAcer (generic) 22\" 60Hz 1080p\nWacom Cintiq 22\" 60Hz 1080p\n\nPeripherals ⌨️🖱️🕹️:\n\nKeyboard: Ergodox EZ\nMouse: Logitech G502 Lightspeed wireless\nController: Stadia Controller\n\nHardWare ⚙️:\n\nGPU: Nvidia RTX ASUS TUF 3090TI OC\nCPU: Ryzen 9 3900X\nRAM: G.skill Trident Z 32gb 3200MHz\nMOBO: Asus something xD\n\nExtra ⚙️💡📷🎧🎙️:\n\nElgato StreamDeck (15x Button)\nElgato Key Light Air x2\nGoXLR\nSony Alpha5100 (x3)\nElgato Cam Link Pro\nBeyerdynamic DT990 Pro 250 Ohm\nSHURE SM7B\n\nOther ⚙️:\n\nRaspBerry Pi4-B 8GB\nBeyerdynamic DT770 Pro 80 Ohm\n\nSubscribe to get access to:\na bunch of emotes\na big thankyou!\n\n(click here, or the image above)\n\nThank you for the support\nDonations allow me to stream fulltime.\n\n(Donations are via PayPal and are non-refundable)\nClick Here, or the 🎁 above\n\nName: Leif\nAge: 33 or something\nHeight: 200cm\nNorwegian\nViking\nOslo (GMT+2)\nAD/HD\nAspergers spectrum disorder (Autism)\n\nBeen streaming since april 2019\n\nJoin OikoumE's Paradise for:\nAlerts when OiK goes live\nAI stuff\n3d Printing\nProjects\nChit-chat\n\nClick Here\nDiscord.itsoik.com\n\nMatisseTec\npsyayavt\nMessyJam by theMessyCoder\n\nMatisseTec\npsyayavt\nJernJam by IrishJohnGames",
    "timestamp": 1736847360336
  },
  "corrovt": {
    "bio": "credits\n\nstarting up screen art: AsterWisteriaVT\n\nHi, I’m CORRO a zombie streamer and signed musician from Sweden.\n\nI love retro games and anything horror or chaos.\n\n⚠️ADHD warning⚠️\n\nOshi mark: 🧟💚\nArt tag: #CorroArt\nBusiness inquiries & sponsorships: corrovt@gmail.com\n\nbluesky\nupdates and brainrot\n\ninstagram\nsame but with photos\n\nspotify\nmy music\n\nall links\n\njoin my monster squad at the discord",
    "timestamp": 1736847395246
  },
  "soulbug": {
    "bio": "Hello!\nMy name is Alma. I'm 25 years old and from Sweden. My channel is chill & very much laid back so if you vibe with that ur very welcome to chill/lurk here. Sometimes you'll find me streaming with music only!\nI have no set streaming schedule and like to do it whenever I'm in the mood for it\n\nJoin my discord! :) which offers some react roles found in ''introduction'' to do some group PvM\n\nList of commands:\n!telos\n!enrage\n!discord\n!followage\n!mouse\n\nNo excessive spamming\nAsk for permission if you want to post a link\nJust follow the terms of service & tone down on the toxicity\n\nFeel free to subscribe if you enjoy the content :)\n\nIf you enjoy the content and would like to support the stream, feel free to donate. Please note donations are non-refundable",
    "timestamp": 1736847406221
  },
  "rsn_jesper": {
    "bio": "MinkenTv $600.00\nCirenz donated $200.00\nHzxxRS $45.00\ndanyycsgo $30.00\nSmurku $20.00\nTheBelgian $10.00\nsHalfNightKnight donated $7.00\nOlenKeisari donated $7.00\nrusianantte $1.69\nemil247k donated $1.00\nRullaKepap donated $1.00\nBlazejumperz donated $1.00\n\nCommands\n\n!Sr\n!Uptime\n!level\n!Discord\n!Youtube\n!Songlist\n!Currentsong\n!YellowF\n!Warden\n!Telos\n!Nex\n!Rax\n!Qbddeath\n!Archcalc\n!Archalarm\n!OutLast\n\ni update my streaming page over time.\nI'm sorry if there is a mistake in the text.\nthanks for all support",
    "timestamp": 1736847442354
  },
  "danthespoon": {
    "bio": "Hey guys!!!\nI primarily used to play a lot of card games like \"Magic The Gathering\", Hearthstone, \"Final Fantasy Trading Card Game\" (fftcg), and the like going to national and international tournaments and the like.\nAsk me about worlds for fftcg :p\nBut now hear I am streaming runescape to you guys another game I enjoy immensely.\n\nI'm always looking to improbve the way i stream so please feel free to give me tips on how to improve my stream.\n\nNot necessary but if you wanted to tip me you can do it here ^^\n\nPlease keep things mature, don't disrespect anyone here and most importantly have fun.\n\nGraphics card-\nNvidia GeForce GTX 1050 Ti (hoping to upgrade this one soon\nProcessor-\nIntel COre i9-10900K\n32gb ram\n3x 32in curved monitors",
    "timestamp": 1736847445393
  },
  "tangoalphamango": {
    "bio": "Hi! My name is Tango. I'm 27 years old, I speedrun a variety of games and listen to video game soundtracks.\n\nCurrent PB times below.\n\nRuneScaper since 06\n\nWelcome to the channel!\n\nLego Star Wars The Complete Saga (Prequels) Any% PB 1:23:38\n\nPhasmaphobia Tanglewood Duo Any% PB 1m 53s 093ms\n\nRTA All-Star Summit 10m 58s\n\nRTA Bonny Greens PB 10m 14s\n\nRTA Bowser Highlands PB 10m 51s\n\nMario Kart 8 Deluxe 96 Tracks 150cc (Items) PB 4:36:28\n\nMario Kart 8 Deluxe 48 Tracks 150cc (items) PB 2:12:23\n\nMario Kart 8 Deluxe 48 Tracks (DLC) 150cc (Items) PB 2:16:53\n\nModern Warfare 2 Remastered Any% Recruit PB 2:06:00\n\nCall of Duty 4 Modern Warfare Any% Recruit PB 2:59:58 (FML)\n\nSubscribing directly supports the channel. Sub free w/ Twitch Prime\n\nClick the image above to make a donation and help support the stream!\n\nJoin the discord for stream updates and community posts!\n\nOMEN 30L Gaming Desktop PC, NVIDIA GeForce RTX 3080 Graphics Card, 10th Generation Intel Core i9-10850K Processor, 32 GB RAM, 1 TB SSD and 2 TB Hard Drive, Windows 10 Home (GT13-0092, 2020)\n\nHeadphones (Astro A40s)\n\nMouse (SteelSeries - Aerox 9 Wireless Ultra Lightweight Honeycomb Water Resistant RGB Optical Gaming Mouse With 18 Programmable Buttons - Black)\n\nKeyboard (ROCCAT Pyro Mechanical PC Gaming Keyboard, RGB Lighting, AIMO Illumination, Wired Computer Keyboard, Detachable Wrist/Palm Rest, Linear Feel Red Switches, Brushed Aluminum Top Plate, Black)\n\nMicrophone (SUDOTACK USB Streaming Podcast PC Microphone, Professional 192KHZ/24Bit Studio Cardioid Condenser Mic Kit with Sound Card Boom Arm Shock Mount Pop Filter, for Skype Youtuber Karaoke Gaming Recording)",
    "timestamp": 1736847448407
  },
  "stakarn": {
    "bio": "Förväntas inte, men uppskattas otroligt mycket! Men om du donerar,kom ihåg att samtliga donationer inte är återbetalningsbara. För att donera via streamlabs så kan du trycka på bilden här ovanför. Vill ni donera skins så går det bra att göra det också, bara att trycka här. Ni är bäst! Hade gött hajj!\n\nTwitter\nInstagram\nSteam\nSnapchat- rikardrannali\n\nmy mail is staaakarn@gmail.com\n\nCPU: AMD Ryzen 7 5800X\n\nGPU: GeForce RTX 3070\n\nRAM: G.SKILL 16GB\n\nMouse: Xtrfy m4 wireless\n\nKeyboard: Svive Triton RGB\n\nHeadset: Logitech PRO X\n\nGaming Monitor: SharkGaming 240hz\n\nRikard här, Försöker streama så mycket som möjligt. Som det ser ut just nu så streamar jag enbart mornar då jag oftast jobbar eftermiddagar. Har inget fastställt streamingschema men följ mina sociala medier för att få reda på när jag går live!\nVa med på resan mot att bli fulltime streamer.",
    "timestamp": 1736847452088
  },
  "tubbzfl": {
    "bio": "16 Feb 2024: 99 Summoning\n\n18th Feb 2024: 120 Necromancy + 120 Invention\n\n19th Feb 2024: 99 Prayer + 152 combat level\n\n14th March 2024: 500% Arch-Glacor\n\n25th May 2024: 99 Fletching\n\n21st June 2024: 200% Zammy Solo\n\n23rd June 2024: 300% Zammy Solo\n\n12th July 2024: 120 Defence\n\n30th July 2024: Vorkath Green Logged\n\n6th Aug 2024: 99 Cooking\n\n19th Sept 2024: 1000% Arch-Glacor\n\n24th Sept 2024: Priff + Elder Olvs\n\n28th Sept 2024: Hardmode Zuk Cape\n\nBe Respectful to everyone.\nObviously: No racism, no homophobic comments, no religious slurs etc.\nNo advertising or self-promotion.\nEnglish Only Please.\nAdvice is allowed, but be respectful about it.\n\nRuneScape Videos\n\nBecome a subscriber for a Ad Free Experience!\nGet Custom Emotes! (more coming soon)\nGet a Custom Discord Role!\n& Earn Channel Points Faster!\n\nStay up to date by following me on Twitter!\n\nYou never have to donate but if you want to, it is incredibly appreciated! <3 (All donations are final, no refunds)\n\nHere are my PC Specs!\nCPU: AMD Ryzen 5 3600X\nGPU: Nvidia GTX 2060 (6GB)\nRAM: 16GB (3200Mhz)\nStorage: 250GB SSD & 500GB HDD & 1TB SSD\nMotherboard: ASUS PRIME A320M-K\nMonitor: BenQ GL2460 (1080p@75Hz)\nMic: Blue Snowball\n\nI'm 24\nI've been making content since 2015 and it's been a dream to make it full time :)\nI don't actually only play RuneScape, I play other games sometimes too, crazy right?\nMarried to @AppleExtract :peeposhy:",
    "timestamp": 1736847454672
  },
  "staciij": {
    "bio": "Hey, my name is Stacii!\n\nA young lass based in the UK.\n\nYou'll most likely find me playing RuneScape however I might stream other things from time to time!\n\nBusiness Enquiries: staciijtv@gmail.com\n\nThe standard rules I guess..\n\nNo Racism\nNo Hate Speech\nTry and keep politics to a minimum\nRespect everyone\nBanter is good, banter is great but if its obvious its getting to someone please stop.\nNo backseating unless its requested.\n\nPlease and thanks <3\n\nHEY, I see you looking to donate.\n\nI will never EVER ask for a donation however if you wish to donate I would be very appreciative and I will send ALL the virtual hugs and most probably cry.",
    "timestamp": 1736847457362
  },
  "lossalito": {
    "bio": "Namn: Niklas\nSpel: CS2, Fortnite\nSveriges kanske sämsta pc spelare (alla spel inkluderad)\n\nKlicka på bilden för att donera. Alla donationer uppskattas otroligt mycket och det är helt frivilligt att donera, så tänk innan du donerar.\n\nDonationerna går oftast tillbaks till mina följare i form av giveaway´s eller liknande.\n\nOBS: INGA ÅTERKÖP!\n\nLegender som har giftat subs:\n\nchucknoirris: 42st\neagle25125 30st\nsimonpersson13 20st\nburningh8 10st\nOlssonjohan 10st\nSkiyte 10st\nkattenkalle1 1st\n\nTop 3 som subbat längst:\n\n18 mån - chucknoirris\n12 mån - simonpersson13\n9 mån - mackethenoob\n\nSom prenumerant får du några super trevliga fördelar!\n\nExtra chans att vinna Giveaways\nBot immunitet (du kan länka fritt i chatten)\nSUB-Roll i discordkanalen\nSUB-Badge framför ditt namn\nÅtkomst till SUB-Emotes\nImmunitet mot ADS på kanalen!\n\nComputer:\n\nCPU: Intel Core i9-9900K\nGPU: MSI GeForce RTX 3070 Gaming X Trio\nRAM: HyperX Fury DDR4 3200MHz 32GB\nHarddrive: Samsung 980 M.2 NVMe SSD 250GB\nMOBO: MSI Z390 MPG Gaming Pro Carbon AC\nPSU: 750W\n\nEquipment:\n\nMonitor: ASUS VG248QE (144hz, 1ms)\nKeyboard: Tesoro Excalibur V2 Black [Kailh Blue]\nMouse: Xtrfy M4 RGB Black\nMousepad: Xtrfy GP1\nHeadset: HyperX Cloud Flight\nWebcam: Logitech c920\nMicrophone: Røde NT-USB\nMicrophone Stand: Røde PSA1\nStream deck: Elgato Stream Deck\nCapture card: Elgato HD60 Pro\nChair: Razer Tarok Ultimate Gamingstol\n\nIngame settings:\nCS2:\n\nResolution: 4:3 1280x960 stretched\nVideo settings: Low\nSens: Ingame: 1.6 Win: 6/11\nDPI: 800\nLaunch options: -tickrate 128 +fps_max 0 -novid -nojoy -high -refresh 144\n\nFortnite:\n\nResolution: 16:9 1920x1080\nVideo settings: Low\n\nDet är helt frivilligt och jag uppskattar alla tittare oavsett om dom donerar eller inte.\n\nAlla donationer kommer upp i streamen!",
    "timestamp": 1736847460586
  },
  "redone_tv": {
    "bio": "om du vill åka på ett grymt lan under lovet i feb så passa på och åk till beaconlan tyck på bilden så kommer du få 10% på ditt köp som drars av i kassan :D\n\n♛ GPU: navida geforce RTX 2080TI\n♛ Internminne: Corsair 32GB (2x16GB) DDR4 3200MHz\n♛ CPU: Intel Core i7 9700K 3.6 GHz\n♛ Sdd: Samsung 860 EVO 1TB\n♛ PSU:Corsair TX 750w Gold\n♛ moderkort:ASUS ROG STRIX Z390-F GAMING\n♛fläktar: Corsair LL Series LL120 RGB Svart 3-pack med kontroller\n♛Mus: Asus ROG Gladius II Origin\n♛Tangentbord: Razer ornata v2\n\nRedone#21901\n\njag är en snubbe på 35år som bor i sthlm här kommer du få se först o främst throne and liberty. jag heter emanuel men kallas för redone\n\ninget rasistiska ord\ningen mobbing eller snacka skit om andra = timeout/ban*\nlänka eller göra reklam för dig själv = ban\n\nkom ihåg att donera pengar Väljer du själv och jag ser helst att du är 18+\n\ntop\n1.Gamingtag987 150kr\n2.LAXEN - 15kr\n\nmin desiger gör ett riktig bra jobb och rekommender alla till henne, hon kan även göra efter önskemål som jag gjorde <3 my desiger does a really good job and recommend everyone to her, she can also make to order like I did <3 tryck på bilden för komma till hennes fiverr/ press the picture and get to her fiverr <3",
    "timestamp": 1736847463926
  },
  "ktthelemon": {
    "bio": "Haaiiiiii my name is Katie (Kt) and I play all sorts of games :3 Varying between runescape, cs go and league of legends!",
    "timestamp": 1736847466974
  },
  "zingstah": {
    "bio": "Hey new friend,\n\nThe name is Dhir, I currently reside in Texas. #everythingisbiggerintexas\n\nI've mainly played RuneScape 3 but would definitely ATTEMPT to play variety games 1x/week (soon). A big cluer & a decent pvmer, if I do say so myself, heh.\n\nI listen to a wide variety of music, so recommend me something!\n\nif you stream, let me know so I can support you too! Thank you for cheering me on and following on other platforms, I am motivated!\n\nthe some of these pics take you to my socials btw\n#coffeeaddict #rs3addict #zingstah\n\nZero-tolerance for discrimination or bullying (be inclusive)\n\nBe respectful of others, and be friendly!\n\nFollow twitch community guidelines\n\nAvoid religious and political discussions we are here to have fun keep spirits high!\n\nIf you troll, it's all g but like don't go overboard with it, ya kno?\n\nNO SPOILERS (if im watching something y'kno)\n\nBackseating is chill but again don't go overboard with it, ya kno?\n\ntrying to make panels line up. hi\n\n!QOTD - (my question I'd like to know)\n!icalledthat -\nEVERY WEEK WE OPEN CLUES U CAN CALL A CASKET IN DISCORD IN THE CHANNEL CALLED #icalledthat\n+2% for subs\nroll a random number generator\n(0 - 28% for master clues)\n(0 - 38% for elite clues)\n(0 - 48% for master clues)\n\nsocials - !twitter !discord !tiktok\n!instagram\n\nSome frequently asked questions\n\nHow old are you? - guess lol older than 30\n\nHow long have you been streaming? - I started streaming in March 2022.\n\nWhere do you Work? Pharmacy\n\nAre donations refundable? - Donations are nonrefundable. Charge-backs are highly detrimental due to the fact that funds may be spent/transferred.\n\nWhat is your degree in? bachelors in Biotechnology at UH\n\nRuneScape goals? - GOLDEN MASTER OF CLUES TITLE soon\nyellow phat achieved 9-9-23\nWhite phat?\n\nDo u have a OF? What? click here oof\n\nYou got a gf? No big chillin\n\nsubscribe here\nor check if you have amazon prime :)\n\nclick donate picture ^ if you'd like to see it pop up on stream!\n\n(doesn't popup on stream options)\n3. buy me a coffee luvu peepocaffeine\n4. Patreon\n5. @zingstah on venmo\n\npaypal.me/zingstah\n\n**ONLY GIVE IF YOU CAN **\n\nTYSM friends <3\n$60 AgonyTanks\n$70 tubanate\n$100 Tripledylan\n$35 R3yloaded\nte amo mucho\n\nkOORUI 1440P monitor\nsceptre 1080p monitor\n\nlogitech g600\nmaono microphone\n\n1st pc built myself\nz790 ddr5 motherboard\ni9 14900k 32 GB ram\n4060 ti 16gb vram\nmontech x3 case",
    "timestamp": 1736865563263
  },
  "esplaycom": {
    "bio": "Esplay är en ny plattform som revolutionerar sättet vi utövar och njuter av CS på, bara för Sverige. Den nya matchmaking- och turneringsplattformen Esplay erbjuder en smidig upplevelse för spelare på alla nivåer där man kan spela lite mer avslappnat med sina vänner, eller ta sig hela vägen upp mot eliten i de större turneringarna.\n\nVi uppmuntrar dig att testa spela i vår Matchmaking, kör en Gather och testa gå med i ett Space.\n\nVerifiera dig med BankID och få tillgång till:\n\nPrime Matchmaking\nDrops\nSuper Gathers\noch mer!\n\nDu som verifierad kan också välja att spela mot eller med endast verifierade spelare.\n\nVerifiera dig idag!\n\nSamla din gemenskap\n\nEngagera din gemenskap med fantastiska aktiviteter och håll dem uppdaterade med de senaste nyheterna.\n\nAnsök om att skapa ditt egna space och skapa turneringar med annat!\n\nGå med i ett space idag!",
    "timestamp": 1736865566694
  },
  "adamskiifn": {
    "bio": "Donations are NOT required. They are used to make the stream better and are much appreciated <3 non-refundable\n\nPaypal\n\nMouse: Logitech G Pro Superlight\nKeyboard: Apex 7 TKL\nHeadset: Logitech G Pro X\nWebcam: Logitech streamcam\nDesk: Arozzi Gaming Desk\nGraphics Card: ASUS GeForce RTX 2060 DUAL EVO Advanced\nProcessor: AMD Ryzen 9 3900X\nMotherboard: MSI MPG B550 GAMING PLUS\n\n*NO SPEAKING ABOUT RELIGION OR\nCONTROVERSIAL TOPICS\n*NO weird Flirting\n*NO Racism or hurtful comments\n*NO Self-Promoting\n*NO toxicity or Drama\n*NO excessive spamming\n\nKeep the chat ONLY IN SWEDISH & ENGLISH\n\nI decide who I play with!\nSubscribers are first in line at subgames.",
    "timestamp": 1736865570610
  },
  "rsbeckyy": {
    "bio": "My about pannels, stream overlay, starting soon and BRB screens made by Woutiiee: https://twitter.com/Woutiiee\n\nMy 8 animated emotes are made by TheNyxed: https://twitter.com/TheNyxed\n\nWelcome to my channel! Glad you could pop in :)\n\nMy name is Becky, and I'm from New Zealand!\n\nI mostly play and stream Runescape3!\n\nOutside of gaming I enjoy horse riding and hiking, and sometimes do the odd bit of painting.\n\n!discord\n!insta\n!steam\n!twitter\n!snapchat\n!chair\n!delicious\n!f\n!iron\n!lurk\n!uptime\n!yikes\n!boo\n!brain\n!socials\n!gem\n!tune\n!woot\n!party\n!dance\n!countryroads\n!chickenfried\n\nI have a discord server for my twitch channel where I make announcements for when I'm going live and for my streaming community! Everyone is welcome :) The invite link is :\nhttps://discord.gg/SgBZfSBHB6\n\nDonations are never expected but are always much appreciated <3\nNon-refundable\n\nRTX 3060 GPU\nRyzen 2600 CPU\n16GB 2666RAM",
    "timestamp": 1736865576920
  },
  "beard_hub": {
    "bio": "Looking to Shop use my Amazon Code at the end of your URL when you find a Product no cost to you at all! ( ?tag=beardhub-20 ) Doesn't change the way you shop at all! Just Helps you support your Favorite Stream!\n\nNo commercials or ads!\n\nChat Badge and 16 Subscriber Emotes\n\nGain Beard Coins faster\n\nMy Whole Hearted appreciation for your full support!\n\n(Subscribe for FREE with Twitch Prime)\n\nHi everyone Darren, I am 31 years old I live in OK /US with my Beautiful Wife Kait. I love to Game mainly play MMO's, but I play other games sometimes and Just Chatting. I would love to get into Traveling Streams like exploring new memories etc. Here in my Community we are about fun and support and laughs just having an overall great time . Sometime things get spicy as long as things do not go to far everything is alright. I love this Community more then anything and all of you have shown me im not alone and that there is a support system of genuine all around amazing people and i will never be able to thank you all enough! i hope one day to grow enough to support and help others. I started Streaming 2021 and now recently getting on all of these other platform. I was diagnosed with T & B Cell Blood and Bone marrow Lymphoma Cancer in 2019 and fought through 2019-2020 with extreme treatment so every day i am here i count as a gift and just grateful. just want to do the best i can.\n\nFollow my Twitter for updates.\n\nChat & have Fun!\n\nDonations are not necessary but are completely appreciated and truly help so much.\nTo note all donations are nonrefundable,\nevery donation will go to support the stream as well as myself to continue for all of you :)\n\nForever!\n\nDon't be Rude. Self-explanatory.\nNo politics and religion.\nNo racism or homo/transphobic negativity!\nDon't bring outside drama or any for that matter in here. I'm not here to parent all of you.\n\nThings and Stuff.\n\nFollow & Like!\n\nLIKE & Subscribe!\n\nFollow & Like!\n\nP.O. Box 5922 Edmond, OK 73083\nYou can put down Darren on the mail/package.\n\nCPU:\nAMD Ryzen 9 7950X3D 16-Core 32 Thread Processor\n\nGPU:\nNVIDIA GeForce RTX 3080 Ti Founders\n\nHD/RAM:\n1T x2 / 64GB (2 x 32GB Corsair Vengeance RBG) 6400 MHz DDR5\n\nCPU COOLER: NZXT Kraken z73 (360)\n\nMONITORS:\n(3X) 34 inch Curved \"34c\" Omen - 165Hz QHD\n\nMOBO:\nASUS TUF Gaming X670E\n\nPERIPHERALS:\nMicrophone - Shure SM7B /\nCamera - Elgato Facecam Pro 4k / Keyboard - G512 Carbon 'Gx Brn' / Mouse - Logitech G600\n\n+IRL: Samsung Galaxy S24 Ultra - ROG RAPTURE GT - AXE16000 Router /Netgear cm1000 Modem - Comica clip mics - NightHawk netgear/AT&T-Tmobile providers linked\n\nOther Options\nCa$h App: $Beardhub",
    "timestamp": 1736865579515
  },
  "chrilleekberg": {
    "bio": "I'm older than 40 and still have plenty of years left for fun in this world Borned and raised in Motala + Stockholm in Sweden.\n\nFor serious business inquiries, please email: chrilleekberg@live.se\n\nCurrent setup is all from SteelserieS\n\nHeadphones :Arctic nova pro wireless\nMouse : Aerox 3 wireless\nMic : Alias PRO\nKeyboard : Apex pro tkl\nMousepad :5xxl\nNumkeys in White\nSpeakers : Arena 7\n\nThe BIGGEST thanks for the guys on STEELSERIES for providing me with what i think is the best gear a gamer can use <3\n\nAmd 7800x3d with a 4080 RTX gpu.\nThe stream is powered by a laptop with RTX 3070 and Elgato 4KX capturecard\n\nDonations are HIGHLY appreciated and much welcomed! Please duly note that donations are not refundable!\n\nhttps://paypal.me/chrilleekberg?country.x=SE&locale.x=sv_SE\n\nThanks to elgato for providing me with really good and necesary gear as\nStreamdeck\nFacecam Pro 4k\nCapturecard 4K X\n\nIntroducing STREAM ON DEMAND.\nUse the donation page on this side and write the x amount of hours u want me to be online .\nPricing as follow\n12pm-12am 100 usd per hour.\n12am-6am 300usd per hour since i need my beauty sleep and will be tired if i cant sleep...\n\nRemeber u saw this here first =D",
    "timestamp": 1736865585312
  },
  "matissetec": {
    "bio": "I am building out a webpage called matissetec.dev which is about creating a workflow management tool for ai artwork. The types of things you can do is image creation, animated emote creation, and all sorts of other fun.\n\nHow does this current setup I have work?\n\nLots of different parts!\n\nLanguages\npython\nC#\nvue\nhtml\ncss\nPrograms\nComfyui\nChataigne (x2 instances)\nUnity\nVideo\nNDI x10000\nAI transformation of ndi\nWeb framework\nFlask\nStream stuff\n3 pc setup\n4 monitors\ncamera (nexigo 60fps 1080)\nBlue Yeti mics\nKinesis keyboard",
    "timestamp": 1736865589136
  },
  "mcnee92": {
    "bio": "My Name is McNee a 32 Year old pizza loving RuneScape Streamer. I love this game and really enjoy doing clues.\n\nYou are an extension of the community, treat others how you want to be treated!\n\nDon't harass other users. This includes racism, homophobia, sexism etc.\n\nUse common sense and do not be an idiot.",
    "timestamp": 1736865592804
  },
  "ltsmaluwa": {
    "bio": "Feel free to donate, it would mean the world to me. HUGS xoxo\n\n♥ Name: Johanna\n♥ Age: Those who knows.. knows\n♥ From: Sweden\n♥ Game: Mostly l play cs (esportal)\n\n♥ Go and check out my amazing boyfriend ★\nhttps://www.twitch.tv/esportal_whoopsy\n\n♥ No bullying\n♥No racism\n♥Treat others as you would like to be treated\n♥ No nasty comments\n\n♥ CPU: Intel Core i5 10400\n♥ RAM: DDR4 SDRAM 16 GB\n♥Motherboard: LENOVO 370A (U3E1)\n♥ GPU: NVIDIA GeForce GTX 1650 SUPER\n♥Screen 1: AOC 25\" 25G3ZM\n♥Screen 2: AOC 24\" G2460PF\n♥Mouse: Logitech G G603\n♥Keyboard: HyperX Alloy Core RGB\n♥Headset: HyperX cloud 2 (gun metal)",
    "timestamp": 1736865627576
  },
  "godjamot": {
    "bio": "@farifx from Fiverr absolutely KILLS it! Panel Link to view his profile <3\n\n~ 27yo (November, 8th)\n~ Streaming to Save Runescape\n~ VERY 4/20 Friendly!\n~ 2 Pets, 1 dog (Zuko) 1 cat (Louise)\n~ Rap/Hip-Hip, EDM, Rock\n~ Fav. Color - Orange/Pruple\n~ Whiskey >>> Beer\n~ Beard Gang 12+ Years Strong\n~ RuneScape Nerd\n~Pokemon Nerd (Suicune is Fav)\n\n!2024goals / !sus\n!discord / !pvm / !lurk\n!clues / !cluetrainer\n!anime /\n!raid / !subraid\n\n~ Quest Cape! (2016-current)\n~ Reaper Title (12/26/23)\n\n~ 120 25/29 Skills\n~ 200M 9/29 Skills\n~ Currently ~4.2B+ Total XP\n~ 66/71 Towards Golden \"the Clue Chaser\" Title (Third Age Piece from Base Title)\n~ 11/41 Boss Logs Complete\n\n-Completionist, MQC, GReaper, & 120 All well under-way !",
    "timestamp": 1736865630233
  },
  "n5wmob": {
    "bio": "An Australian based clan whom welcome anyone, Where topics will be based on a\n\nAnything goes system - But also work as a team.\n\nThis clan is for those Runescape members wanting to just enjoy the game and spend time with friends.\n\nFind us on Discord:\nAdd clan leader on discord and ask for an invite > N5W\n\nThings you need to bring to our clan:\n\nSense of Humor\nA heart of gold\nRespect\nLet it go attitude\n\n...................................\n\nThis seems like you? Do you feel that you need a down to earth clan that is just here to have a bit of fun?\n\nAsk for an invite.\n\nMobtato - In love with RS3 - Loves People - Loves Singing. Most of all loves his RS community. I am a man who loves to use a Potato Filter to bring funny content while playing a game I adore. Feel free to follow me and ask me any questions about the games I play.\n\nNo racism.\n\nNo excessive vulgarity.\n\nDon't post links or images that promote other streamers/cosplayers, are pornographic, gore related or of malicious intent.\n\nBanter between two people is fine, personally attacking someone is not. Respect one another, and everyone's right to privacy.\n\nKeep the Chat of clear of religion and politics.\n\nMods reserve the right to take disciplinary action at their discretion -I trust my mods and it's their word against yours.\n\nHave fun! Life is too short to spread negativity.\n\nMIS MAG B550M Motar WIFI Motherboard\n\nThermaltake Z-ONE RGB 16GB (4x16GB) 3200MHz\n\nGigabyte Geforce RTX 4090 Gaming\n\nMSI MAG core Liquid 240R Cooler\nMSI MPG GUNGNIR 110M case\n\nThermaltake Toughpower 1000W\n\nMonitor 1: MSI 32 Inch Gaming\n\nMonitors 2/3: LG 29 Inch Gaming x 2\n\nMouse: MX Master 3\n\nAMD Ryzen 5 5600X 6 core, 12 Thread OEM\n\nKeyboard: SteelSeries Artic Pro",
    "timestamp": 1736865633695
  },
  "0rland0smith": {
    "bio": "Hello thank you for stopping by my page. I have played Runescape on and off for a fair few years. I am very bad at the game and not afraid to admit it. I love to help as many people as possible and mainly stream Scuffed Clue Hunting/PVM.\n\nStream times will vary as manage a full time career. Follow me on Socials for more info when I'm going live!\n\nActive user so be sure to to come follow me on here ^^ - https://twitter.com/0rland0Smith\n\nTo those that wish to further support the channel could subscribe via TTV when live for a small fee however DO NOT PANIC!\n\nDon't forget to link your Amazon Prime account with Twitch Prime to get one FREE subscription a month to support any streamer and have access to more unique stuff to that stream. This hits different and is more special to me as you've chosen to support this channel over many other amazing creators out there ^^\n\nThank You <3\n\nCan't reiterate enough how much these are NEVER Expected At All!, But Forever Always Appreciated.\n\nThank you all again for all your love and support in the channel. All donations will be used to help improve the stream and your experience!\n\nDonations can't be refunded so please only donate if you feel you're able to and not going to struggle.\n\nAny Racism, Bullying, Harassment of any kind will result in an INSTANT Ban.\n\nPlease be kind, respectful, and courteous to all members of this community.\n\nNo approved or suspicious links to be posted anywhere unless approved by myself or a Moderator.\n\nBackseat gaming is encouraged but no where to draw the line in over stepping boundaries.\n\nPersonal information of any kind is not to be shared with anyone at any point.\n\nAny toxicity or talking trash about other members/streamers of this community or any other will result in a timeout followed by a BAN if persistent.\n\nStay Super Duper Hydrated XD\n\nMost important is to have fun enjoy your time here and get sassy with the streamer ^^\n\nDo Your Clues!\n\nGraphics Card\n\nNVIDIA GeForce RTX 3070\n8 GB GDDR6\n\nRAM\n\n16 GB DDR4 (3200 MHz)\n128 GB maximum installable RAM\n\nProcessor\n\nIntel® Core™ i7-12700F Processor\n12-core\n2.1 GHz / 4.9 GHz\n\nStorage\n1 TB SSD\n\nMonitors\nMSI Optix MAG301CR2 Full HD 30\" Curved Gaming Monitor\nMSI Optix G24C4 Full HD 24\" Curved LED Gaming Monitor\n\nMicrophone\nHYPERX HX-MICQC-BK Quadcast Gaming Microphone - Black\n\nHeadset (When Worn)\nSteel Series ARCTIS 9X\n\nMouse\nRazer Naga Pro\n\nKeyboard\nRazer BlackWidow Elite - Tactile & Silent Mechanical Gaming Keyboard\n\nChair\nGTFORCE TURBO RECLINING SPORTS RACING GAMING OFFICE DESK PC CAR FAUX LEATHER CHAIR (Grey)",
    "timestamp": 1736865637785
  },
  "eltophat": {
    "bio": "Ahoy!!!\n\nI'm TopHat nice to meet you. I randomly show up and do dumb things on the internet when I'm bored\n\nHope you enjoy your stay\n\nFeel Free to ask any questions during stream but here are some for free\n\nWhy did you start streaming-\nI really needed a excuse to feel productive playing games XD\n\nWhat's your favorite color?\nwell there's a lot of green on the channel... maybe purple\n\nWhat games do you like?\na lot of them but hollow knight and Zelda are probably my favorite\n\nNo Need To But If You Do I Really Do Appreciate It",
    "timestamp": 1736865640366
  },
  "2hard2kill20": {
    "bio": "Hey Guys and Gals, My names Trent or also known better as 2hard2kill!\nlike most people i have a love for gaming! one of those games is Rs3, i have been playing since classic and still love it till this day and would love to share that with you.\n\nBe Kind\nRespect others\nInclude everyone\nno bullying, sexism, racism, homophobia or other hate based chat\nno ethnic, sexual, religious, disability, agist or transphobic slurs\n\nProcessor: 12th Gen Intel(R) Core(TM) i7-12700F 2.10 GHz\nRam: 16GB\nNividia GeForce RTX 3060\n12th Gen Intel(r) Core(TM) 17-12700F\n\nDonations of any kind are not expected, however any donations are greatly appreciated!\n\nPlease note all donations are NON-REFUNDABLE! Please ensure you have the funds and can afford to donate prior to doing so!",
    "timestamp": 1736865642949
  },
  "dextrog": {
    "bio": "Hi everyone! You can call me Dex or Lizzie. I'm a 23 year old, full-time university student so I stream around my school schedule. I'm mostly a variety streamer but I love my comfy games :)\n\nStarted Streaming: 10/30/2021\nMaxed: 3/9/24\n\nOn-stream alert\nYou can also do it privately!\nDonations go toward improving the stream!\n\nTop Donos\n\ndemon_kingkingster: $20\n23costa: $10\ndeadgirl: $5\nbuhzerq:$5",
    "timestamp": 1736865645965
  },
  "kloakbengt": {
    "bio": "Namn: Sara\nÅlder: 33\nFavoritvapen: Gäddan\n\nJag spelar mest CS2 och framförallt på\nEsplay\nHär finns det mycket skratt, chatt och fnatt!\n\nFölj mig gärna på mina sociala medier\n\nInstagram\n\nTwitter\n\n• Donationer är väldigt uppskattat men behövs inte.\n• Kom ihåg att donationer är non-refundable.\n\nKom in i värmen i min SPACE på Esplay HÄR",
    "timestamp": 1736865649797
  },
  "oojsan": {
    "bio": "Use my coupon: 1EVELINA\n\nUse coupon: Werren10\n\nI'm playing cs2 at Esplay.",
    "timestamp": 1736865653017
  },
  "thoughtxdaughter": {
    "bio": "COME SAY HI TO ME ON:\n\nDiscord\nTiktok\nInstagram\nPinterest\nYoutube\n\n(click the image for all da links)",
    "timestamp": 1736865656303
  },
  "ronjalovisah": {
    "bio": "♥ My name is Ronja.\n\n♥ I'm from south Sweden and i speak both swedish and english in my streams.\n\n♥ I've played a lot of computer games since I was a little kid and always liked it a little bit too much.\n\n♥ I started playing Counter-Strike when i bought my PC last year and that's the game i usually stream.\nCounter-Strike is also my first FPS game ever.\n\n♥ From the beginning I started streaming because my friends wanted to see me fail on Counter-Strike. (𝑠𝑡𝑖𝑙𝑙 𝑑𝑜)\n\n♥ I'm a shy person who's not able to talk to myself but if you write in my chat you'll break the wall and I'll be more than happy to talk to you, sometimes a little bit too much.\n\nThank you for your continued support! Donations allow me to continue being a content creator and your support is greatly appreciated!\nDonations are non refundable.\n\n𝒀𝒐𝒖 𝒄𝒂𝒏 𝒅𝒐𝒏𝒂𝒕𝒆 𝒘𝒊𝒕𝒉 𝑺𝒘𝒊𝒔𝒉 𝒉𝒆𝒓𝒆!\n\n♥ Follow the Twitch Community Guidelines.\n♥ Be kind!\n♥ Respect other viewers.\n♥ No hate speech.\n♥ No links and/or advertisements, if necessary those are welcome on discord.\n\n♥ 𝐒𝐰𝐞𝐝𝐢𝐬𝐡 𝐚𝐧𝐝 𝐞𝐧𝐠𝐥𝐢𝐬𝐡 𝐨𝐧𝐥𝐲.\n\nFor business inquiries - ronjalovisah@icloud.com\n\nWhy would you consider subscribing?\n\n♥ no ads, at all.\n♥ access to sub only channels on discord.\n♥ you support me in another way than donation.\n♥ lots of thanks and love from me.\n\n𝑆𝑢𝑏𝑠𝑐𝑟𝑖𝑏𝑒 𝑓𝑜𝑟 𝑓𝑟𝑒𝑒 𝑤𝑖𝑡𝘩 𝑝𝑟𝑖𝑚𝑒 𝑔𝑎𝑚𝑖𝑛𝑔!\n\n♥ Processor: AMD Ryzen 7 5700G\n♥ Graphics card: NVIDIA GeForce RTX 3060\n♥ Monitor: MSI 27\" 165 Hz\n♥ Mouse: Logitech G Pro X Superlight 2\n♥ Keyboard: HyperX Alloy Origins\n♥ Headphones: HyperX Cloud Stinger 2\n♥ Microphone: HyperX Quadcast S\n♥ Webcam: Streamplify",
    "timestamp": 1736865658831
  },
  "rimbodejaneiro": {
    "bio": "Jag är en mamma till två små barn. Ni kan kalla mig Jenna eller Rimbo. Helt klart gaming beroende. Har två barn, två hundar och två katter.\n\nSpelar för det mesta CS2 på Esplay men lite fortnite och andra spel slinker också in.\n\nInstagram: RimboDeJaneiroCS\nSteamvänkod: 1508544645\nTikTok: RImboDeJaneiro\nEmail: Rimbodejaneiro@gmail.com\n\nVill du istället donera via Paypal så kan du göra det här.\n\nDonationer är inte ett måste men uppskattas enormt mycket.\nKom ihåg att inga donationer återbetalas.\n\nTryck på bilden för att joina min discordkanal\n\nVill du donera via Swish tryck på bilden ovan.\n\nDonationer är inte ett måste men uppskattas enormt mycket.\nKom ihåg att inga donationer återbetalas.\n\nCPU: 13th Gen i5 -13400F\nGPU: AMD Radeon RX 6750 XT\nTangentbord: Hyper X Alloy 2\nMus: Logitech Pro X Superlight\nHörlurar: Logitech G33\nMikrofon: Hyper X Quadcast S\nMikrofon: Razer Kiyo\n\n!titsize\n!Penis\n!dadjoke\n!watchtime\n!8ball\n!followage\n!age\n!fakta\n!fmk\n!win",
    "timestamp": 1736865662433
  }
}