{
  "esplaycom": {
    "bio": "Esplay är en ny plattform som revolutionerar sättet vi utövar och njuter av CS på, bara för Sverige. Den nya matchmaking- och turneringsplattformen Esplay erbjuder en smidig upplevelse för spelare på alla nivåer där man kan spela lite mer avslappnat med sina vänner, eller ta sig hela vägen upp mot eliten i de större turneringarna. Vi uppmuntrar dig att testa spela i vår Matchmaking, kör en Gather och testa gå med i ett Space.",
    "timestamp": 1736825675856
  },
  "parally": {
    "bio": "Name: Kayla Age: 26 Hobby: Full-time streamer Game: RuneScape since April 2021",
    "timestamp": 1736825675856
  },
  "drincompetentgamer": {
    "bio": "Hobby: Gaming",
    "timestamp": 1736825874889
  },
  "nooblet": {
    "bio": "Name: Not provided Age: 27 Location: Minnesota Game: Runescape since 2006 Rig: AMD Ryzen 5 5600x 32GB RAM Asus GTX 1080 Strix 2TB SSD 6TB HDD Corsair TXM Gold 650W Webcam: Logitech C920 Mic: Audio-Technica AT2020",
    "timestamp": 1736847244386
  },
  "tiimwork": {
    "bio": "Name: Tim Age: 33 Location: Sweden Hobby: Poetry Games: CS2 Dota 2 Hearthstone WoW SoD Rig: MSI GeForce RTX 4070 Intel Core i7 13700F 32GB RAM Logitech C920e Webcam Keyboard Corsair K55 Xtrfy M4 Mouse",
    "timestamp": 1736847248069
  },
  "masterpipe83": {
    "bio": "Name: Not provided Age: 41 Hobby: Gaming Family: Father of four Rig: Not provided",
    "timestamp": 1736847251948
  },
  "moistbean": {
    "bio": "Name: Chris Hobby: Gaming Rig: Nvidia RTX 2070 Super Intel i5-10600K 16GB RAM 128GB M.2 SSD 2 Monitors",
    "timestamp": 1736996938535
  },
  "kimsomfan": {
    "bio": "Name: Kim Age: 27 Games: CS League of Legends",
    "timestamp": 1736847261141
  },
  "whitegrimreaper_": {
    "bio": "Name: White Age: 29 Location: Seattle Hobby: Gaming DnD Rig: 5800X3D MSI 4090 Suprim Liquid X 32GB RAM 2 Monitors Mic: Rode Procaster",
    "timestamp": 1736847264224
  },
  "kram_yelooc": {
    "bio": "Music by Approaching Nirvana",
    "timestamp": 1736847266891
  },
  "libbzer": {
    "bio": "Name: Liban Nickname: Libbe Libbz Hobbies: Gaming Football Location: Stockholm Languages: English Swedish",
    "timestamp": 1736847269360
  },
  "punishd1": {
    "bio": "PC Setup: CPU AMD Ryzen 7 5800X3D GPU GeForce RTX 3060 Ti RAM 16GB Case Corsair iCUE 4000X RGB",
    "timestamp": 1736847272020
  },
  "gurkinator_": {
    "bio": "Giveaway every Tuesday CPU Intel I5 13600K GPU GeForce GTX 4070ti RAM 32GB Keyboard Corsair K95 Platinum Headset Steelseries Arctis 7 Plus Mouse Razer Deathadder v3 Pro Sensitivity 0.73 Resolution 1280x960",
    "timestamp": 1736847274540
  },
  "eskeminha": {
    "bio": "PC Setup: Motherboard Gigabyte B650M Gaming X AX Memory 32GB DDR5 CPU AMD Ryzen 7 7800X3D GPU MSI GeForce RTX 4070Ti Monitor LG 65 inch 4k TV Keyboard Logitech MX Keys Mouse Logitech MX Master 3S Headset HyperX Cloud II Mic Razer Seiren",
    "timestamp": 1736847277112
  },
  "chevalricrs": {
    "bio": "Name: Chevalric Nickname: Chev or Daan Games: RuneScape 3 Pokémon RPGs PC Setup: CPU AMD Ryzen 7 3700X GPU GeForce GTX 1660 Super RAM 32GB Mouse SteelSeries Rival 310 Keyboard Razer Ornata Chroma Monitor Acer Nitro XV273X 28 inch Mic Devine M-Mic USB Webcam FHD Camera Timezone: GMT Activities: Streaming Gaming Community Building",
    "timestamp": 1736847280476
  },
  "duckonatruck": {
    "bio": "Name: Jesper Nickname: Duck Age: 26 Location: Sweden Games: CS Hobbies: Gaming",
    "timestamp": 1736847284450
  },
  "cakez77": {
    "bio": "Name: Cakez Age: Not specified Hobbies: Programming, gaming, game development Games: Gothic 1-3, Skyrim, POE, They Are Billions Setup: CPU: AMD Ryzen 7 3700X GPU: GeForce RTX 4060 Ti RAM: 32GB DDR4 Mainboard: ROG STRIX B550-F Gaming Mic: Shure SM7B Interface: Yamaha AG03",
    "timestamp": 1736847288042
  },
  "ibraofc": {
    "bio": "Name: Sebastian Age: 33 Location: Göteborg, Sweden Ethnicity: Lebanese/Swedish",
    "timestamp": 1736847291779
  },
  "1linneaa": {
    "bio": "Name: Linnéa Age: 31 Hobbies: Gaming Games: CS, League of Legends, World of Warcraft",
    "timestamp": 1736847357735
  },
  "itsoik": {
    "bio": "Name: Leif Age: 33 Height: 200cm Location: Oslo, Norway Hobbies: AI, 3D printing, streaming Setup: Monitors: Samsung G9 Neo 49  240Hz, Asus VG27B 24  165Hz, Wacom Cintiq 22  GPU: Nvidia RTX ASUS TUF 3090TI OC CPU: Ryzen 9 3900X RAM: G.skill Trident Z 32GB Peripherals: Ergodox EZ keyboard, Logitech G502 Lightspeed Mic: SHURE SM7B Misc: Elgato StreamDeck, GoXLR, Sony Alpha5100 cameras",
    "timestamp": 1736942709968
  },
  "corrovt": {
    "bio": "Name: CORRO Hobbies: Gaming, music Location: Sweden Games: Retro and horror games",
    "timestamp": 1736847395246
  },
  "soulbug": {
    "bio": "Name: Alma Age: 25 Location: Sweden Hobbies: Gaming, chill streams",
    "timestamp": 1736847406221
  },
  "rsn_jesper": {
    "bio": "Name: Jesper Hobbies: Streaming Setup: Not specified",
    "timestamp": 1736847442354
  },
  "danthespoon": {
    "bio": "Hobbies: Gaming, card games (Magic The Gathering, Hearthstone, Final Fantasy Trading Card Game) Games: Runescape Setup: GPU: Nvidia GeForce GTX 1050 Ti CPU: Intel Core i9-10900K RAM: 32GB Monitors: 3x 32in curved monitors",
    "timestamp": 1736847445393
  },
  "tangoalphamango": {
    "bio": "Name: Tango, Age: 27, Hobbies: Speedrunning and listening to video game soundtracks. PC: OMEN 30L Gaming Desktop, NVIDIA GeForce RTX 3080, Intel Core i9-10850K, 32GB RAM, 1TB SSD, 2TB HDD. Headphones: Astro A40s. Mouse: SteelSeries Aerox 9 Wireless. Keyboard: ROCCAT Pyro Mechanical. Microphone: SUDOTACK USB. Games: Lego Star Wars, Modern Warfare, Mario Kart 8 Deluxe.",
    "timestamp": 1736847445393
  },
  "stakarn": {
    "bio": "Name: Rikard, Hobbies: Streaming mornings, CPU: AMD Ryzen 7 5800X, GPU: GeForce RTX 3070, RAM: G.SKILL 16GB, Mouse: Xtrfy m4 wireless, Keyboard: Svive Triton RGB, Headset: Logitech PRO X, Monitor: SharkGaming 240Hz.",
    "timestamp": 1736847445393
  },
  "tubbzfl": {
    "bio": "Age: 24, Hobbies: Content creation since 2015, Games: RuneScape. PC: AMD Ryzen 5 3600X, Nvidia GTX 2060, 16GB RAM, 250GB SSD, 500GB HDD, 1TB SSD. Mic: Blue Snowball. Married to @AppleExtract.",
    "timestamp": 1736847445393
  },
  "staciij": {
    "bio": "Name: Stacii, Location: UK. Games: RuneScape.",
    "timestamp": 1736847445393
  },
  "lossalito": {
    "bio": "Name: Niklas, Games: CS2, Fortnite. PC: Intel Core i9-9900K, MSI GeForce RTX 3070, 32GB RAM, Samsung 980 SSD. Monitor: ASUS VG248QE, Mouse: Xtrfy M4 RGB, Keyboard: Tesoro Excalibur V2, Headset: HyperX Cloud Flight, Mic: Røde NT-USB.",
    "timestamp": 1736847445393
  },
  "redone_tv": {
    "bio": "Name: Emanuel, Age: 35, Location: Stockholm. Games: Throne and Liberty. PC: Intel Core i7-9700K, NVIDIA RTX 2080TI, 32GB RAM, Samsung 860 EVO SSD.",
    "timestamp": 1736847445393
  },
  "ktthelemon": {
    "bio": "Name: Katie (Kt), Games: RuneScape, CS:GO, League of Legends.",
    "timestamp": 1736847445393
  },
  "zingstah": {
    "bio": "Name: Dhir, Location: Texas, Age: Over 30. Hobbies: Clue scrolling in RuneScape 3. PC: Z790 DDR5, Intel i9-14900K, Nvidia RTX 4060 Ti, 32GB RAM. Mic: Maono. Monitors: KOORUI 1440P, Sceptre 1080P.",
    "timestamp": 1736847445393
  },
  "adamskiifn": {
    "bio": "PC: AMD Ryzen 9 3900X, ASUS GeForce RTX 2060, MSI B550 Gaming Plus, Mouse: Logitech G Pro Superlight, Keyboard: Apex 7 TKL, Headset: Logitech G Pro X.",
    "timestamp": 1736847445393
  },
  "rsbeckyy": {
    "bio": "Name: Becky, Location: New Zealand. Hobbies: Horse riding, hiking, painting. Games: RuneScape 3. PC: Ryzen 2600, RTX 3060, 16GB RAM.",
    "timestamp": 1736847445393
  },
  "beard_hub": {
    "bio": "Darren 31 years old from OK/US. Married to Kait. Love to Game mainly play MMO's. Started streaming in 2021. Diagnosed with T&B Cell Blood and Bone marrow Lymphoma in 2019, survived intense treatment. CPU: AMD Ryzen 9 7950X3D, GPU: NVIDIA GeForce RTX 3080 Ti, RAM: 64GB Corsair Vengeance DDR5, Monitors: 3x 34  Omen, Peripherals: Shure SM7B Mic, Elgato Facecam Pro 4k, Logitech G600 Mouse."
  },
  "chrilleekberg": {
    "bio": "Older than 40, born and raised in Motala + Stockholm, Sweden. CPU: AMD 7800x3d, GPU: RTX 4080, Stream powered by laptop with RTX 3070. Gear from SteelSeries: Arctic Nova Pro wireless, Apex Pro TKL keyboard, Aerox 3 wireless mouse. Donations appreciated."
  },
  "matissetec": {
    "bio": "Building matissetec.dev for AI artwork workflow management. Languages: Python, C#, Vue. Programs: Comfyui, Chataigne, Unity. Stream setup: 3 PCs, 4 monitors, Nexigo 60fps 1080 camera, Blue Yeti mics, Kinesis keyboard."
  },
  "mcnee92": {
    "bio": "McNee, 32 years old, loves RuneScape and doing clues."
  },
  "ltsmaluwa": {
    "bio": "Johanna, age unknown, from Sweden, plays CS on Esportal. CPU: Intel Core i5 10400, GPU: NVIDIA GTX 1650 SUPER, RAM: 16GB. Follow my boyfriend on Twitch at https://www.twitch.tv/esportal_whoopsy."
  },
  "godjamot": {
    "bio": "27yo, streaming RuneScape. 4/20 friendly, loves Rap/Hip-Hop, EDM, Rock. Pets: Zuko (dog), Louise (cat). Favorite color: Orange/Purple. Quest cape, Reaper title, 120 all skills, 200M XP, 66/71 Golden Clue Chaser Title."
  },
  "n5wmob": {
    "bio": "Australian RS3 clan, welcoming all. Mobtato, loves RS3, people, and singing. CPU: AMD Ryzen 5 5600X, GPU: RTX 4090, RAM: 16GB. Monitors: MSI 32-inch, LG 29-inch (x2). Keyboard: SteelSeries, Mouse: MX Master 3."
  },
  "0rland0smith": {
    "bio": "Stream RuneScape, scuffed clue hunting/PVM. Graphics: NVIDIA GeForce RTX 3070, RAM: 16GB DDR4, CPU: Intel i7-12700F, Storage: 1TB SSD. Monitors: MSI MAG301CR2 30  curved, MSI G24C4 24  curved. Mic: HyperX Quadcast, Headset: SteelSeries ARCTIS 9X."
  },
  "eltophat": {
    "bio": "TopHat, favorite games: Hollow Knight, Zelda. Streams when bored."
  },
  "2hard2kill20": {
    "bio": "Trent, aka 2hard2kill. Played RS3 since classic. CPU: Intel i7-12700F, GPU: RTX 3060, RAM: 16GB."
  },
  "dextrog": {
    "bio": "Dex/Lizzie, 23, full-time university student, variety streamer. Stream start: 10/30/2021. Maxed: 3/9/24."
  },
  "kloakbengt": {
    "bio": "Sara, 33, plays CS2 on Esplay."
  },
  "oojsan": {
    "bio": "Playing CS2 at Esplay."
  },
  "thoughtxdaughter": {
    "bio": "Come say hi on Discord, TikTok, Instagram, Pinterest, Youtube."
  },
  "ronjalovisah": {
    "bio": "Ronja from south Sweden, plays Counter-Strike. CPU: AMD Ryzen 7 5700G, GPU: RTX 3060, Monitor: MSI 27  165Hz, Mouse: Logitech G Pro X, Keyboard: HyperX Alloy Origins."
  },
  "rimbodejaneiro": {
    "bio": "Jenna (Rimbo), mom of two, loves gaming, plays CS2 on Esplay. CPU: Intel i5-13400F, GPU: Radeon RX 6750 XT, Monitor: HyperX Alloy 2, Mouse: Logitech Pro X Superlight."
  },
  "honkoh": {
    "bio": "Business inquiries: honk1rs@hotmail.com"
  },
  "kreativofc": {
    "bio": "Name: Jesper 'kREATIV' Sedendahl Born in Bollnäs, moved to Stockholm at 4 Lived with my mom until I moved to Umeå to finish school as a Car Painter Full-time caster and video editor at ESEN Studios"
  },
  "7licious": {
    "bio": "Name: Tilde Age: 23 From: Sweden Counter-Strike player Biggest passion: My dog Colin, 3 years old"
  },
  "raynnacs": {
    "bio": "Name: Andreas aka Raynna Age: 28 From: Värmland, Sweden, Creator of Raynna_Bot, Games: Counter-strike, Runescape"
  }
}